app/controllers/users_controller.rb

	def login
		@user = User.find_by(:email => params[:login_user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jordan.kline@gmail.com"], ["LIMIT", 1]]

	def update
		@user = User.find(params[:id])
		@user.update(update_user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "last_name" = $2, "password_digest" = $3, "profile_url" = $4 WHERE "users"."id" = $5  [["updated_at", "2018-10-12 00:21:09.654386"], ["last_name", "Kline"], ["password_digest", "$2a$10$59EZvg.8e6NNPq6qnt7rbe3mRHASQPx6Evmg1vl.1IFVQvzpmOpVO"], ["profile_url", " "], ["id", 1]]